In [1]:
from sqlalchemy import create_engine

import pandas as pd

import seaborn as sns

from matplotlib import pyplot as plt

In [2]:
database_name = 'scooters'

 

connection_string = f'postgresql://postgres:postgres@localhost:5432/{database_name}'

 

engine = create_engine(connection_string)

In [3]:
query = '''

SELECT companyname, SUM(tripduration)

FROM trips

WHERE tripduration IS NOT NULL

GROUP BY companyname

'''

 

pd.read_sql(query, con = engine)

     companyname           sum
0           Bird  2.046202e+06
1  Bolt Mobility  3.082150e+07
2         Gotcha  3.380278e+04
3           JUMP  2.110013e+05
4           Lime  3.507335e+06
5           Lyft  1.936370e+06
6           SPIN  9.005750e+05

In [8]:
query = '''
SELECT *
FROM scooters
Limit 100;
'''
pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:01:41.247,36.141158,-86.801997,PoweredWDMWW,Powered,69.0,scooter,0.0,Bird
96,2019-05-01 00:01:41.247,36.138786,-86.801667,PoweredSNB79,Powered,88.0,scooter,0.0,Bird
97,2019-05-01 00:01:41.247,36.162634,-86.781603,PoweredM69E2,Powered,91.0,scooter,0.0,Bird
98,2019-05-01 00:01:41.247,36.144795,-86.795576,PoweredHY38F,Powered,88.0,scooter,0.0,Bird
99,2019-05-01 00:01:41.247,36.165809,-86.777780,Powered2WLYW,Powered,98.0,scooter,0.0,Bird

In [13]:
scooters=pd.read_sql(query, con = engine)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [14]:
scooters=pd.read_sql(query, con = engine)
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [21]:
totalscooters = '''
SELECT COUNT(DISTINCT(sumdid))
FROM scooters;
'''

scootercount = pd.read_sql(totalscooters, con = engine)
scootercount

   count
0  10018

In [24]:
everycompanycount = '''
SELECT companyname, COUNT(DISTINCT(sumdid))
FROM scooters
GROUP BY companyname;
'''

companycount = pd.read_sql(everycompanycount, con = engine)
companycount

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1824
5        Lyft   1735
6        Spin    805

In [26]:
timeframe = '''
SELECT MIN(pubdatetime), MAX(pubdatetime)
FROM scooters
'''
scooterstimeframe = pd.read_sql(timeframe, con = engine)
scooterstimeframe

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

#1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [33]:
SUMGRP ='''

SELECT SUMDGROUP

FROM scooters 

GROUP BY SUMDGROUP

'''
GROUPTYPE = pd.read_sql_query(SUMGRP, engine)

GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [34]:
JUSTSCOOTERS = '''

SELECT *

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

AND SUMDID = 'Powered3c24659f-37f5-5549-895c-bccf6d1ab656'

'''

SCOOTERSONLY = pd.read_sql_query(JUSTSCOOTERS , engine)

SCOOTERSONLY.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-17 10:17:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
1,2019-05-17 10:22:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
2,2019-05-17 10:27:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
3,2019-05-17 10:32:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
4,2019-05-18 14:03:13,36.1538,-86.7957,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,0.0,scooter,0.0,Jump

#1a How many scooters did each company have in this time frame?

In [ ]:
TOTALSCOOTERS = '''

SELECT COMPANYNAME,

COUNT(DISTINCT(SUMDID)) COUNTS

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

GROUP BY

COMPANYNAME

'''

SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)

SCOOTERCOUNT

#1b Did the number for each company change over time?

Answer:  Yes, the numbers changed over time for each company.

In [35]:
JUSTSCOOTERS1 = '''

SELECT 

UPPER(SUMDGROUP),

UPPER(COMPANYNAME) COMPANYNAME,

TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,

TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,

TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,

COUNT(DISTINCT(SUMDID))

FROM SCOOTERS 

WHERE 

UPPER(SUMDGROUP) = 'SCOOTER'

---SUMDID ='Powered3c24659f-37f5-5549-895c-bccf6d1ab656'

GROUP BY

UPPER(COMPANYNAME),

UPPER(SUMDGROUP),

TO_CHAR(PUBDATETIME,'MM'),

TO_CHAR(PUBDATETIME,'MONTH'),

TO_CHAR(PUBDATETIME,'YYYY')

ORDER BY

UPPER(COMPANYNAME),

UPPER(SUMDGROUP),

TO_CHAR(PUBDATETIME,'MM'),

TO_CHAR(PUBDATETIME,'MONTH'),

TO_CHAR(PUBDATETIME,'YYYY')

'''

 

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)

SCOOTERSONLY1

      upper companyname month_num month_name year_val  count
0   SCOOTER        BIRD        05  MAY           2019   3064
1   SCOOTER        BIRD        06  JUNE          2019   2910
2   SCOOTER        BIRD        07  JULY          2019   2583
3   SCOOTER        BOLT        05  MAY           2019    346
4   SCOOTER        BOLT        06  JUNE          2019    333
5   SCOOTER        BOLT        07  JULY          2019    276
6   SCOOTER      GOTCHA        05  MAY           2019    223
7   SCOOTER      GOTCHA        06  JUNE          2019    223
8   SCOOTER      GOTCHA        07  JULY          2019    224
9   SCOOTER        JUMP        05  MAY           2019    976
10  SCOOTER        JUMP        06  JUNE          2019   1036
11  SCOOTER        JUMP        07  JULY          2019   1206
12  SCOOTER        LIME        05  MAY           2019   1631
13  SCOOTER        LIME        06  JUNE          2019   1455
14  SCOOTER        LIME        07  JULY          2019    902
15  SCOOTER        LYFT        05  MAY           2019   1376
16  SCOOTER        LYFT        06  JUNE          2019   1152
17  SCOOTER        LYFT        07  JULY          2019   1026
18  SCOOTER        SPIN        05  MAY           2019    687
19  SCOOTER        SPIN        06  JUNE          2019    713
20  SCOOTER        SPIN        07  JULY          2019    570

In [36]:
TOTALSCOOTERS = '''

SELECT COMPANYNAME,

COUNT(DISTINCT(SUMDID)) COUNTS

FROM scooters

WHERE UPPER(SUMDGROUP) = 'SCOOTER'

GROUP BY

COMPANYNAME

'''

SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)

SCOOTERCOUNT

  companyname  counts
0        Bird    3860
1        Bolt     360
2      Gotcha     224
3        Jump    1210
4        Lime    1818
5        Lyft    1735
6        Spin     805

#1c Did scooter usage vary by company?

#2 Are there any scooter companies in compliance with 2 and 3 part of this rule? Are there any trips above 24 hours and trips below 1 minute?